БИТУправление_медицинским_центром_демо/src/Documents/СписокНаПрохождениеМедосмотра/СписокНаПрохождениеМедосмотра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписокНаПрохождениеМедосмотра</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредседательМедКомиссии</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредседателяМедКомиссии</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставительРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДолжностьПредставителяРаботодателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключительногоАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РезультатВыполненияРекомендацийПредАкта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РекомендацииПоКомплексуОздоровительныхМероприятий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщЧисленностьРаботниковУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РаботникиНаТяжРаботахУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковОбязМедосмотрУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруВсего</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруЖенщин</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруДо18Лет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЧисленностьРаботниковПодлежМедосмотруУстУтратаНетрудоспособности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПредыдущегоЗаключительногоАкта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДействияМедосмотраФиксируютсяСметой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолиса</name>
    <comment>Условия обслуживания по медосмотру в рамках договора с контрагентом</comment>
    <type>
      <types>CatalogRef.ВидыПолисов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанЭП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьПриПечатиСметыДействияБезЦены</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМО</name>
    <type>
      <types>CatalogRef.ВидыМедосмотров</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Клиенты</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипМедосмотра</name>
      <type>
        <types>EnumRef.ТипыМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаНеявки</name>
      <type>
        <types>CatalogRef.ПричиныНеявкиНаМедосмотр</types>
      </type>
    </attributes>
    <attributes>
      <name>ФИОКлиента</name>
      <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Профессия</name>
      <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦехУчасток</name>
      <comment>Копия реквизита на случай изменения в будущем в карточке клиента</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВыполнениеРекомендаций</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>EnumRef.МероприятияПоРезультатамМедосмотров</types>
      </type>
    </attributes>
    <attributes>
      <name>Подлежало</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Клиент</name>
      <type>
        <types>CatalogRef.Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>CatalogRef.ДействияМедосмотра</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/Documents/СписокНаПрохождениеМедосмотра/Forms/ФормаРедактированияДанныхКлиента/Module.bsl
#Область ОбработчикиСобытийФормы 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Попытка
		Если Параметры.Свойство("СозданиеНового") Тогда
			СозданиеНового = Истина;
		Иначе
			РедактированиеНесохраненного = Параметры.Свойство("РедактированиеНесохраненного");
			ИндексСтроки = Параметры.ИндексСтроки;
			Клиент = Параметры.Клиент;
			Профессия = Параметры.Профессия;
			ТипМедосмотра = Параметры.ТипМедосмотра;
			ФИОКлиента = Параметры.ФИОКлиента;
			ЦехУчасток = Параметры.ЦехУчасток;
			СПМОСсылка = Параметры.СПМОСсылка;
		КонецЕсли;
	Исключение
		Отказ = Истина;
		ВызватьИсключение "Неверно заданы параметры формы";
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПолеФормыПриИзменении(Элемент)
	
	Модифицированность = Истина;
	Если Элемент.Имя = "Клиент" Тогда
		ФИОКлиента = ОбщегоНазначения.ФИОФизЛица(Клиент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрофессияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	МедосмотрыКлиент.ОбработкаВыбораПрофессии(ЭтаФорма, СтандартнаяОбработка, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПрофессияОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	МедосмотрыСервер.ПрофессияОкончаниеВводаТекстаНаСервере(Текст, СтандартнаяОбработка, ДанныеВыбора);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	Если ЭтаФорма.Модифицированность Тогда
		ВозвращаемыеДанные = Новый Структура;
		ВозвращаемыеДанные.Вставить("Клиент", Клиент);
		ВозвращаемыеДанные.Вставить("Профессия", Профессия);
		ВозвращаемыеДанные.Вставить("ТипМедосмотра", ТипМедосмотра);
		ВозвращаемыеДанные.Вставить("ФИОКлиента", ФИОКлиента);
		ВозвращаемыеДанные.Вставить("ЦехУчасток", ЦехУчасток);
		Если СозданиеНового Или РедактированиеНесохраненного Тогда
			Закрыть(ВозвращаемыеДанные);
		Иначе
			ВозвращаемыеДанные.Вставить("ИндексСтроки", ИндексСтроки);
			ВозвращаемыеДанные.Вставить("СПМОСсылка", СПМОСсылка);
			ТекстОшибки = "";
			СписокИзмененыхПМО = Новый Массив;
			ЗаписатьНовыеДанныеПМОИСПМО(ВозвращаемыеДанные, ТекстОшибки, СписокИзмененыхПМО);
			Если ЗначениеЗаполнено(ТекстОшибки) Тогда
				ПоказатьПредупреждение(, ТекстОшибки);
			Иначе
				Оповестить("СписокНаПрохождениеИзменен", СПМОСсылка); 
				Для Каждого Эл Из СписокИзмененыхПМО Цикл
					Оповестить("ПрохождениеМедосмотраИзменено", Эл);
				КонецЦикла;
				Закрыть();
			КонецЕсли;
		КонецЕсли;
	Иначе
		Закрыть(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ЗаписатьНовыеДанныеПМОИСПМО(ДанныеДляЗаписи, ТекстОшибки, СписокИзмененыхПМО)
	
	НачатьТранзакцию();
	
	ТекущаяСтрока = ДанныеДляЗаписи.СПМОСсылка.Клиенты.Получить(ДанныеДляЗаписи.ИндексСтроки);
	КлиентДоИзменения = ТекущаяСтрока.Клиент;
	ПрофессияДоИзменения = ТекущаяСтрока.Профессия;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПрохождениеМедосмотра.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПрохождениеМедосмотра КАК ПрохождениеМедосмотра
		|ГДЕ
		|	ПрохождениеМедосмотра.СписокНаПрохождениеМедосмотра = &СписокНаПрохождениеМедосмотра
		|	И ПрохождениеМедосмотра.Клиент = &Клиент
		|	И ПрохождениеМедосмотра.ПометкаУдаления = ЛОЖЬ
		|	И ПрохождениеМедосмотра.Профессия = &Профессия";
	
	Запрос.УстановитьПараметр("Клиент", КлиентДоИзменения);
	Запрос.УстановитьПараметр("Профессия", ПрофессияДоИзменения); 
	Запрос.УстановитьПараметр("СписокНаПрохождениеМедосмотра", ДанныеДляЗаписи.СПМОСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка.ПодписанЭП Тогда
			ОтменитьТранзакцию();
			ТекстОшибки = "У данного клиента существуют подписанные документы прохождения медосмотра, изменение клиента не возможно!";
			Возврат;
		КонецЕсли;
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(ДокументОбъект, ДанныеДляЗаписи);
		ДокументОбъект.Записать();
		СписокИзмененыхПМО.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	СПМООбъект = ДанныеДляЗаписи.СПМОСсылка.ПолучитьОбъект();;
	ИзменяемаяСтрока = СПМООбъект.Клиенты.Получить(ДанныеДляЗаписи.ИндексСтроки);
	ЗаполнитьЗначенияСвойств(ИзменяемаяСтрока, ДанныеДляЗаписи);
	МедосмотрыКлиентСервер.ЗаполнитьДанныеПоЧислуРаботниковПодлежащихПереодМедосмотру(СПМООбъект);
	СПМООбъект.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти
